### Terraform Plan Result

<details>
<summary>Click to expand</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/logbook-org/logbook-infra/runs/run-cQ5r9XQUyWQo57cd

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zones.primary: Reading...
data.cloudflare_zones.primary: Read complete after 0s [id=614b06ed0b41dbd9ad07c8c130c0dac4]
cloudflare_record.ui: Refreshing state... [id=e73aed4e6459d6378ba6f1740d770ef7]
cloudflare_record.ui_netlify_verification: Refreshing state... [id=7bd3543686b13d52755c6f56b09dd9de]
data.aws_vpc.default: Reading...
aws_cloudwatch_log_group.logbook: Refreshing state... [id=/ecs/logbook]
data.aws_availability_zones.available: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs_task_role]
aws_acm_certificate.api_cert: Refreshing state... [id=arn:aws:acm:us-east-2:694300052858:certificate/ca574b72-383f-4bf1-90a9-9ab7d0f22726]
aws_iam_policy.ecs_task_logging: Refreshing state... [id=arn:aws:iam::694300052858:policy/ecs-task-logging-policy]
aws_ecr_repository.logbook: Refreshing state... [id=logbook-repository]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-2:694300052858:cluster/logbook-cluster]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_execution_role]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_iam_role_policy_attachment.ecs_ecr_pull: Refreshing state... [id=ecs_task_role-20250501213107007700000003]
aws_iam_role_policy_attachment.ecs_task_policy: Refreshing state... [id=ecs_task_role-20250501213107015100000004]
aws_iam_role_policy_attachment.ecs_task_logging_attachment: Refreshing state... [id=ecs_task_role-20250501213107073200000005]
aws_iam_role_policy_attachment.ecs_execution_policy: Refreshing state... [id=ecs_execution_role-20250501213106985900000002]
cloudflare_record.acm_validation["api.alponcher.us"]: Refreshing state... [id=3ac773771e724fb595fa9dff1bb01180]
aws_acm_certificate_validation.cert_validation: Refreshing state... [id=2025-05-22 01:21:23.064 +0000 UTC]
data.aws_vpc.default: Read complete after 0s [id=vpc-0ae1330bde6e6788f]
aws_subnet.public[0]: Refreshing state... [id=subnet-0f7e2d25701f09e3c]
aws_security_group.ecs_service: Refreshing state... [id=sg-0603a648b228c9ae8]
aws_subnet.public[1]: Refreshing state... [id=subnet-05f0124202152b846]
aws_security_group.alb_sg: Refreshing state... [id=sg-0a40f8fdb98e54267]
aws_lb_target_group.logbook_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:694300052858:targetgroup/logbook-tg/39058c5ef95e19dc]
aws_db_subnet_group.default: Refreshing state... [id=logbook-db-subnet-group]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-07644ac5bfe6eabb8]
aws_lb.logbook_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:694300052858:loadbalancer/app/logbook-alb/23674eab0135719a]
aws_security_group.rds_sg: Refreshing state... [id=sg-0ab02c0bd01bf7ddc]
aws_db_instance.logbook_db: Refreshing state... [id=db-4OB72PCJPQOM4TY6BRYW5TAICM]
cloudflare_record.public_api: Refreshing state... [id=4839bc8846a4ca751ec9259fc044451c]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:694300052858:listener/app/logbook-alb/23674eab0135719a/f991b0d08ad32744]
cloudflare_record.api: Refreshing state... [id=3c668095a386b6bd86d00d375fd5d79c]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:694300052858:listener/app/logbook-alb/23674eab0135719a/b6b4a6f157185484]
aws_ecs_task_definition.logbook: Refreshing state... [id=logbook-task]
aws_ecs_service.logbook_service: Refreshing state... [id=arn:aws:ecs:us-east-2:694300052858:service/logbook-cluster/logbook-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.logbook_service will be updated in-place
  ~ resource "aws_ecs_service" "logbook_service" {
        id                                 = "arn:aws:ecs:us-east-2:694300052858:service/logbook-cluster/logbook-service"
        name                               = "logbook-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:694300052858:task-definition/logbook-task:30" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.logbook must be replaced
-/+ resource "aws_ecs_task_definition" "logbook" {
      ~ arn                      = "arn:aws:ecs:us-east-2:694300052858:task-definition/logbook-task:30" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:694300052858:task-definition/logbook-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "694300052858.dkr.ecr.us-east-2.amazonaws.com/logbook-repository:v0.0.26-SNAPSHOT" -> "694300052858.dkr.ecr.us-east-2.amazonaws.com/logbook-repository:v0.0.27-SNAPSHOT"
                  - mountPoints      = []
                    name             = "logbook"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "logbook-task" -> (known after apply)
      ~ revision                 = 30 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # cloudflare_record.ui_netlify_verification will be updated in-place
  ~ resource "cloudflare_record" "ui_netlify_verification" {
        id              = "7bd3543686b13d52755c6f56b09dd9de"
        name            = "netlify-challenge"
        tags            = []
      ~ ttl             = 600 -> 300
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>